nxp-mcuxpresso/mcux-sdk-examples/frdmk28fa/component_examples/flexio_mcu_lcd/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART0 receive data source select: LPUART0_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 transmit data source select: LPUART0_TX pin */

/*! @name PORTC25 (coord A7), LPUART0_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_RX_PIN 25U    /*!<@brief PORTC pin index: 25 */
                                       /* @} */

/*! @name PORTC24 (coord B7), LPUART0_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_TX_PIN 24U    /*!<@brief PORTC pin index: 24 */
                                       /* @} */

/*! @name PORTA11 (coord M11), J24[4]TC_USB_ID
  @{ */
#define BOARD_USB_ID_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB_ID_PIN 11U    /*!<@brief PORTA pin index: 11 */
                                /* @} */

/*! @name PORTA22 (coord K8), J27[7]/FXIO0_D6/PCLK
  @{ */
#define BOARD_USB0_CLKIN_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_USB0_CLKIN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB0_CLKIN_PIN 22U    /*!<@brief PORTA pin index: 22 */
                                    /* @} */

/*! @name PORTE2 (coord C1), U11[5]/QSPIA_DATA0
  @{ */
#define BOARD_QSPIA_DATA0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA0_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                     /* @} */

/*! @name PORTE4 (coord E1), U11[2]/QSPIA_DATA1
  @{ */
#define BOARD_QSPIA_DATA1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA1_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                     /* @} */

/*! @name PORTE3 (coord D1), U11[3]/QSPIA_DATA2
  @{ */
#define BOARD_QSPIA_DATA2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA2_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                     /* @} */

/*! @name PORTE0 (coord A1), U11[7]/QSPIA_DATA3
  @{ */
#define BOARD_QSPIA_DATA3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA3_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                     /* @} */

/*! @name PORTE1 (coord B1), U11[6]/QSPIA_SCLK
  @{ */
#define BOARD_QSPIA_SCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SCLK_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                    /* @} */

/*! @name PORTE5 (coord D2), U11[1]/QSPIA_SS
  @{ */
#define BOARD_QSPIA_SS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SS_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
